src/cf/src/Catalogs/СтатьиДвиженияДенежныхСредств/СтатьиДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиДвиженияДенежныхСредств</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>АвансКлиента</name>
      <description>Avance client</description>
    </items>
    <items>
      <name>ПрибыльОтПродаж</name>
      <description>Bénéfice des ventes</description>
    </items>
    <items>
      <name>НачислениеПоТабелю</name>
      <description>Paie selon la feuille de temps</description>
    </items>
    <items>
      <name>Премия</name>
      <description>Prime</description>
    </items>
    <items>
      <name>Себестоимость</name>
      <description>Prix de revient</description>
    </items>
    <items>
      <name>ПересортицаТоваров</name>
      <description>Reclassement des marchandises</description>
    </items>
    <items>
      <name>УценкаТоваров</name>
      <description>Réductions sur les produits</description>
    </items>
    <items>
      <name>ВыемкаИзКассы</name>
      <description>Retrait de la caisse</description>
    </items>
    <items>
      <name>ВыплатаЗарплаты</name>
      <description>Salaire</description>
    </items>
  </predefined>
  <attributes>
    <name>ДоходыИУбытки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУбытков</name>
    <type>
      <types>EnumRef.ВидыУбытков</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧХозяйственныеОперации</name>
    <attributes>
      <name>ХозяйственнаяОперация</name>
      <type>
        <types>EnumRef.ХозяйственныеОперации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/СтатьиДвиженияДенежныхСредств/ManagerModule.bsl
Функция ПолучитьПоХозяйственнойОперации(ХозяйственнаяОперация) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СтатьиДДСХозяйственныеОперации.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.СтатьиДвиженияДенежныхСредств.ТЧХозяйственныеОперации КАК СтатьиДДСХозяйственныеОперации
	                      |ГДЕ
	                      |	СтатьиДДСХозяйственныеОперации.ХозяйственнаяОперация = &ХозяйственнаяОперация
	                      |	И НЕ СтатьиДДСХозяйственныеОперации.Ссылка.ПометкаУдаления
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	СтатьиДДСХозяйственныеОперации.Ссылка.Наименование");
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции
